doomemacs.org
#+title: DoomEmacsConfigs
#+DESCRIPTION: All Doom Emacs Configs in one file.
#+AUTHOR: Rex Ackermann
#+EMAIL: ackermann88888@gmail.com
#+DATE: 2023-06-28 14:23:43+06:00
#+OPTIONS: toc:5
#+auto_tangle: t
#+startup: showeverything

My doom config.I know it's a mess.

* TABLE OF CONTENTS :toc:
- [[#doomconfig][DoomConfig]]
  - [[#start][start]]
  - [[#private-configuration][Private Configuration]]
  - [[#org-default-location][Org Default Location]]
  - [[#tramp-mode][TRAMP Mode]]
  - [[#load-additional-scripts][Load Additional Scripts]]
  - [[#looks][Looks]]
  - [[#modifications-and-scripts][Modifications and Scripts]]
  - [[#package-configuration][Package Configuration]]
- [[#doominit][DoomInit]]
  - [[#table-of-contents][TABLE OF CONTENTS]]
  - [[#start-1][start]]
  - [[#message][Message]]
  - [[#main][Main]]
- [[#doompackages][DoomPackages]]
  - [[#packages][Packages]]

* DoomConfig

#+DESCRIPTION: Rex's Doom Emacs config
#+AUTHOR: Rex Ackermann
#+EMAIL: ackermann88888@gmail.com
#+DATE: 2023-05-27 00:18:48+06:00
#+property: header-args :tangle ~/.config/doom/config.el
#+OPTIONS: toc:5
#+auto_tangle: t
#+startup: showeverything

** start

#+begin_src emacs-lisp

; $DOOMDIR/config.el -**- lexical-binding: t; -**-

#+end_src


** Private Configuration

Place your private configuration here! Remember, you do not need to run 'doom
sync' after modifying this file!


Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets. It is optional.

#+begin_src emacs-lisp

(setq user-full-name "Rex Ackermann"
      user-mail-address "ackermann88888@gmail.com")

#+end_src


** Org Default Location

If you use `org' and don't want your org files in the default location below,
change `org-directory'. It must be set before org loads!

#+begin_src emacs-lisp

(setq org-directory "~/org/")

#+end_src


** TRAMP Mode

#+begin_src emacs-lisp

(eval-after-load 'tramp '(setenv "SHELL" "/bin/sh"))

#+end_src
** Load Additional Scripts

#+begin_src emacs-lisp

;;; Emacs Load Path
(setq load-path (cons "~/.config/scripts/" load-path))

#+end_src


** Looks

**** Fonts

Doom exposes five (optional) variables for controlling fonts in Doom:

- `doom-font' -- the primary font to use
- `doom-variable-pitch-font' -- a non-monospace font (where applicable)
- `doom-big-font' -- used for `doom-big-font-mode'; use this for
  presentations or streaming.
- `doom-unicode-font' -- for unicode glyphs
- `doom-serif-font' -- for the `fixed-pitch-serif' face

See 'C-h v doom-font' for documentation and more examples of what they
accept. For example:

#+begin_src emacs-lisp


;;(setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)
;;      doom-variable-pitch-font (font-spec :family "Fira Sans" :size 13))

(setq doom-font (font-spec :family "FiraCode Nerd Font Mono" :size 15)
      doom-variable-pitch-font (font-spec :family "FiraCode Nerd Font" :size 15)
      doom-serif-font (font-spec :family "FiraCode Nerd Font" :size 15)
      doom-unicode-font (font-spec :family "FiraCode Nerd Font" :size 15)
      doom-big-font (font-spec :family "FiraCode Nerd Font" :size 25)
      )
  ;; (setq! doom-big-font (font-spec :family "FiraCode Nerd Font Mono" :size 12))
  ;; (setq doom-font "Terminus (TTF):pixelsize=12:antialias=off")
  ;; (setq doom-font "Fira Code-14")

#+end_src

If you or Emacs can't find your font, use 'M-x describe-font' to look them
up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to
refresh your font settings. If Emacs still can't find your font, it likely
wasn't installed correctly. Font issues are rarely Doom issues!


**** Syntax Highlighting Everywhere

#+begin_src emacs-lisp

(global-font-lock-mode t)

#+end_src

**** Theme

There are two ways to load a theme. Both assume the theme is installed and
available. You can either set `doom-theme' or manually load a theme with the
`load-theme' function. This is the default:

#+begin_src emacs-lisp

(setq doom-theme 'doom-molokai)

#+end_src


**** Line Numbers

This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For relative line numbers, set this to `relative'.

#+begin_src emacs-lisp

(setq display-line-numbers-type 'relative)

#+end_src


**** Transparency

toogle transparency with Space t t

#+begin_src emacs-lisp

;;(set-frame-parameter (selected-frame) 'alpha '(<active> . <inactive>))
;;(set-frame-parameter (selected-frame) 'alpha <both>)
(add-to-list 'default-frame-alist '(alpha . (95 . 85)))
(set-frame-parameter nil 'alpha '(80 . 85))

(defun toggle-transparency ()
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (if (eq
     (if (numberp alpha)
         alpha
       (cdr alpha)) ; may also be nil
     95)
    (set-frame-parameter nil 'alpha '(80 . 85))
      (set-frame-parameter nil 'alpha '(95 . 95)))))

#+end_src


**** Window Size

#+begin_src emacs-lisp

;;       '((height . 720)
;;         (width . 1080)))
;; (setq default-frame-alist '((fullscreen . maximized)))
(add-to-list 'default-frame-alist '(fullscreen . maximized))
(setq frame-inhibit-implied-resize t)

;; (setq +lsp-company-backends '(:separate company-yasnippet company-capf))

;; (defun gjg/winner-clean-up-modified-list ()
;;   "Remove dead frames from `winner-modified-list`"
;;   (dolist (frame winner-modified-list)
;;     (unless (frame-live-p frame)
;;       (delete frame winner-modified-list))))
;; (advice-add 'winner-save-old-configurations :before #'gjg/winner-clean-up-modified-list)

#+end_src

#+RESULTS:
: t

**** MODELINE

The modeline is the bottom status bar that appears in Emacs windows.  For more information on what is available to configure in the Doom modeline, check out:
  https://github.com/seagle0128/doom-modeline

#+begin_src emacs-lisp

;; (set-face-attribute 'mode-line nil :font "Ubuntu Mono-13")
(setq doom-modeline-height 30     ;; sets modeline height
      doom-modeline-bar-width 5   ;; sets right bar width
      doom-modeline-persp-name t  ;; adds perspective name to modeline
      doom-modeline-persp-icon t) ;; adds folder icon next to persp name
#+end_src


**** MINIMAP
A minimap sidebar displaying a smaller version of the current buffer on either the left or right side. It highlights the currently shown region and updates its position automatically.  Be aware that this minimap program does not work in Org documents.  This is not unusual though because I have tried several minimap programs and none of them can handle Org.

#+begin_src emacs-lisp

;; (minimap-mode)
;; (add-hook 'kill-buffer-hook 'minimap-kill)
;; (add-hook 'kill-emacs-hook 'minimap-kill)
#+end_src

#+RESULTS:

** Modifications and Scripts

**** Key Maps

#+begin_src emacs-lisp
(map! :leader
      :desc "Search in Buffer" "/" #'+default/search-buffer
      :desc "Go to" "." #'helm-find-files
      :desc "Sudo-Edit" "t s" #'sudo-edit
      :desc "Imenu-List" "t I" #'imenu-list-smart-toggle
      :desc "Toggle Transparency" "t t" #'toggle-transparency
      )

#+end_src

#+RESULTS:
: imenu-list-smart-toggle


**** Emacsclient startup

#+begin_src emacs-lisp
;; (defun emacsclient_startup (_)
;;   (demap-open))

;; (add-to-list 'after-make-frame-functions 'minimap-mode)

;; (add-hook 'server-visit-hook 'demap-open)
#+end_src


**** Run Code Block

#+begin_src emacs-lisp

;; This function runs code inside selected block or or on whole buffer.

(defun auto_quickrun (beginning-of-buffer end)
  "Runs selected if a region is active, otherwise runs not-selected."
  (interactive "r")
  (if (region-active-p)
      (quickrun-region beginning-of-buffer end)
    (quickrun)))

(map! :leader
      :desc "RunCode-quickrun" "c r" #'auto_quickrun
      :desc "RunCode-quickrun-buffer" "c b" 'quickrun
      )
;; (global-set-key (kbd "SPC c r") 'auto_quickrun)
#+end_src

#+RESULTS:
: quickrun


****** C Block

#+begin_src emacs-lisp

(org-babel-do-load-languages
 'org-babel-load-languages '((C . t)))

#+end_src

**** :exec

#+begin_src emacs-lisp
;; (defun my/run-babel-exec-blocks ()
;;   "Execute babel :exec blocks in current buffer."
;;   (interactive)
;;   (org-babel-map-src-blocks nil
;;     (let ((header (org-babel-get-header (point) :eval)))
;;       (when (string-match-p ":exec" header)
;;         (org-babel-execute-src-block)))))
;; (add-hook 'after-save-hook #'my/run-babel-exec-blocks)

;; (setq enable-local-eval t)
#+end_src


**** Org-babel-edit

#+begin_src emacs-lisp

(defun org-babel-edit ()
  "Edit python src block with lsp support by tangling the block and
then setting the org-edit-special buffer-file-name to the
absolute path. Finally load eglot."
  (interactive)

;; org-babel-get-src-block-info returns lang, code_src, and header
;; params; Use nth 2 to get the params and then retrieve the :tangle
;; to get the filename
  (setq tangled-file-name (expand-file-name (assoc-default :tangle (nth 2 (org-babel-get-src-block-info)))))

  ;; tangle the src block at point
  ;; (org-babel-tangle '(4))
  (org-edit-special)

  ;; Now we should be in the special edit buffer with python-mode. Set
  ;; the buffer-file-name to the tangled file so that pylsp and
  ;; plugins can see an actual file.
  (setq-local buffer-file-name tangled-file-name)
  (eglot-ensure)
  )
#+end_src

Key Maps

#+begin_src emacs-lisp

(map! :leader
      :desc "Org-Block" "b e" #'org-babel-edit
      )

#+end_src


