doomemacs.org
**** docx

Check if current buffer's file is docx ,then convert file to a org file and open it.And when I save the file convert file to the docx's name emacs lisp

Here's an Emacs Lisp function that checks if the current buffer's file is a docx, converts it to org format, and opens it. When you save the org file, it will be automatically saved with the same name as the original docx file.

#+begin_src emacs-lisp

(defun convert-docx-to-org-and-open ()
  "Convert the current buffer's file from docx to org format and open it."
  (interactive)
  (when (and (buffer-file-name)
             (string= (file-name-extension (buffer-file-name)) "docx"))
    (let** ((docx-file (buffer-file-name))
           (org-file (concat (file-name-sans-extension docx-file) ".org")))
      (call-process "pandoc" nil nil nil "--from=docx" "--to=org"
                    docx-file "-o" org-file)
      (find-file org-file)
      (add-hook 'after-save-hook
                   (call-process "pandoc" nil nil nil "--from=org" "--to=docx"
                                 (buffer-file-name) "-o" docx-file)))))

#+end_src

Key Maps

#+begin_src emacs-lisp

(global-set-key (kbd "C-c d") 'convert-docx-to-org-and-open)

#+end_src

This would bind the function to the key sequence C-c d.


