config.el

(defun convert-docx-to-org-and-open ()
  "Convert the current buffer's file from docx to org format and open it."
  (interactive)
  (when (and (buffer-file-name)
             (string= (file-name-extension (buffer-file-name)) "docx"))
    (let** ((docx-file (buffer-file-name))
           (org-file (concat (file-name-sans-extension docx-file) ".org")))
      (call-process "pandoc" nil nil nil "--from=docx" "--to=org"
                    docx-file "-o" org-file)
      (find-file org-file)
      (add-hook 'after-save-hook
                   (call-process "pandoc" nil nil nil "--from=org" "--to=docx"
                                 (buffer-file-name) "-o" docx-file)))))

(global-set-key (kbd "C-c d") 'convert-docx-to-org-and-open)

;; (defun lsp-org ()
;;   (interactive)
