config.el
;;   (-if-let ((virtual-buffer &as &plist :workspaces) (-first (-lambda ((&plist :in-range))
;;                                                               (funcall in-range))
;;                                                             lsp--virtual-buffer-connections))
;;       (unless (equal lsp--virtual-buffer virtual-buffer)
;;         (setq lsp--buffer-workspaces workspaces)
;;         (setq lsp--virtual-buffer virtual-buffer)
;;         (setq lsp-buffer-uri nil)
;;         (lsp-mode 1)
;;         (lsp-managed-mode 1)
;;         (lsp-patch-on-change-event))

;;     (save-excursion
;;       (-let**** (virtual-buffer
;;               (wcb (lambda (f)
;;                      (with-current-buffer (plist-get virtual-buffer :buffer)
;;                        (-let**** (((&plist :major-mode :buffer-file-name
;;                                         :goto-buffer :workspaces) virtual-buffer)
;;                                (lsp--virtual-buffer virtual-buffer)
;;                                (lsp--buffer-workspaces workspaces))
;;                          (save-excursion
;;                            (funcall goto-buffer)
;;                            (funcall f))))))
;;               ((&plist :begin :end :post-blank :language) (cl-second (org-element-context)))
;;               ((&alist :tangle file-name) (cl-third (org-babel-get-src-block-info 'light)))

;;               (file-name (if file-name
;;                              (f-expand file-name)
;;                            (user-error "You should specify file name in the src block header.")))
;;               (begin-marker (progn
;;                               (goto-char begin)
;;                               (forward-line)
;;                               (set-marker (make-marker) (point))))
;;               (end-marker (progn
;;                             (goto-char end)
;;                             (forward-line (1- (- post-blank)))
;;                             (set-marker (make-marker) (1+ (point)))))
;;               (buf (current-buffer))
;;               (src-block (buffer-substring-no-properties begin-marker
;;                                                          (1- end-marker)))
;;               (indentation (with-temp-buffer
;;                              (insert src-block)

;;                              (goto-char (point-min))
;;                              (let ((indentation (current-indentation)))
;;                                (plist-put lsp--virtual-buffer :indentation indentation)
;;                                (org-do-remove-indentation)
;;                                (goto-char (point-min))
;;                                (- indentation (current-indentation))))))
;;         (add-hook 'post-command-hook #'lsp--virtual-buffer-update-position nil t)

;;         (when (fboundp 'flycheck-add-mode)
;;           (lsp-flycheck-add-mode 'org-mode))

;;         (setq lsp--virtual-buffer
;;               (list
;;                :in-range (lambda (&optional point)
;;                            (<= begin-marker (or point (point)) (1- end-marker)))
;;                :goto-buffer (lambda () (goto-char begin-marker))
;;                :buffer-string
;;                (lambda ()
;;                  (let ((src-block (buffer-substring-no-properties
;;                                    begin-marker
;;                                    (1- end-marker))))
;;                    (with-temp-buffer
;;                      (insert src-block)

;;                      (goto-char (point-min))
;;                      (while (not (eobp))
;;                        (delete-region (point) (if (> (+ (point) indentation) (point-at-eol))
;;                                                   (point-at-eol)
;;                                                 (+ (point) indentation)))
;;                        (forward-line))
;;                      (buffer-substring-no-properties (point-min)
;;                                                      (point-max)))))
;;                :buffer buf
;;                :begin begin-marker
;;                :end end-marker
;;                :indentation indentation
;;                :last-point (lambda () (1- end-marker))
;;                :cur-position (lambda ()
;;                                (lsp-save-restriction-and-excursion
;;                                  (list :line (- (lsp--cur-line)
;;                                                 (lsp--cur-line begin-marker))
;;                                        :character (let ((character (- (point)
;;                                                                       (line-beginning-position)
;;                                                                       indentation)))
;;                                                     (if (< character 0)
;;                                                         0
;;                                                       character)))))
;;                :line/character->point (-lambda (line character)
;;                                         (-let [inhibit-field-text-motion t]
;;                                           (+ indentation
;;                                              (lsp-save-restriction-and-excursion
;;                                                (goto-char begin-marker)
;;                                                (forward-line line)
;;                                                (-let [line-end (line-end-position)]
;;                                                  (if (> character (- line-end (point)))
;;                                                      line-end
;;                                                    (forward-char character)
;;                                                    (point)))))))
;;                :major-mode (org-src-get-lang-mode language)
;;                :buffer-file-name file-name
;;                :buffer-uri (lsp--path-to-uri file-name)
;;                :with-current-buffer wcb
;;                :buffer-live? (lambda (_) (buffer-live-p buf))
;;                :buffer-name (lambda (_)
;;                               (propertize (format "%s(%s:%s)%s"
;;                                                   (buffer-name buf)
;;                                                   begin-marker
;;                                                   end-marker
;;                                                   language)
;;                                           'face 'italic))
;;                :real->virtual-line (lambda (line)
;;                                      (+ line (line-number-at-pos begin-marker) -1))
;;                :real->virtual-char (lambda (char) (+ char indentation))
;;                :cleanup (lambda ()
;;                           (set-marker begin-marker nil)
;;                           (set-marker end-marker nil))))
;;         (setf virtual-buffer lsp--virtual-buffer)
;;         (puthash file-name virtual-buffer lsp--virtual-buffer-mappings)
;;         (push virtual-buffer lsp--virtual-buffer-connections)

;;         ;; TODO: tangle only connected sections
;;         (add-hook 'after-save-hook 'org-babel-tangle nil t)
;;         (add-hook 'lsp-after-open-hook #'lsp-patch-on-change-event nil t)
;;         (add-hook 'kill-buffer-hook #'lsp-kill-virtual-buffers nil t)

;;         (setq lsp--buffer-workspaces
;;               (lsp-with-current-buffer virtual-buffer
;;                 (lsp)
;;                 (plist-put virtual-buffer :workspaces (lsp-workspaces))
;;                 (lsp-workspaces)))))))



;; imenu-list
