doomemacs.org
** Package Configuration

Whenever you reconfigure a package, make sure to wrap your config in an
`after!' block, otherwise Doom's defaults may override your settings. E.g.

  (after! PACKAGE
    (setq x y))

The exceptions to this rule:

  - Setting file/directory variables (like `org-directory')
  - Setting variables which explicitly tell you to set them before their
    package is loaded (see 'C-h v VARIABLE' to look up their documentation).
  - Setting doom variables (which start with 'doom-' or '+').

Here are some additional functions/macros that will help you configure Doom.

- `load!' for loading external **.el files relative to this one
- `use-package!' for configuring packages
- `after!' for running code after a package has loaded
- `add-load-path!' for adding directories to the `load-path', relative to
  this file. Emacs searches the `load-path' when you load packages with
  `require' or `use-package'.
- `map!' for binding new keys

To get information about any of these functions/macros, move the cursor over
the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
This will open documentation for it, including demos of how they are used.
Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
etc).

You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
they are implemented.
(add-hook 'window-setup-hook #'toggle-frame-maximized)

#+begin_src emacs-lisp


#+end_src


**** Imenu

#+begin_src emacs-lisp

;; imenu-list

(setq imenu-list-focus-after-activation t)
(setq imenu-list-auto-resize t)
(setq zone-timer (run-with-idle-timer 100 t 'zone))

#+end_src


**** org-auto-tangle

#+begin_src emacs-lisp
;; org-auto-tangle

;; (require 'org-auto-tangle)
;; (add-hook 'org-mode-hook 'org-auto-tangle-mode)
;; (setq org-auto-tangle-default t)

(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

(defun dt/insert-auto-tangle-tag ()
  "Insert auto-tangle tag in a literate config."
  (interactive)
  (evil-org-open-below 1)
  (insert "#+auto_tangle: t ")
  (evil-force-normal-state))

(map! :leader
      :desc "Insert auto_tangle tag" "i a" #'dt/insert-auto-tangle-tag)
#+end_src


**** Clippy

#+begin_src emacs-lisp
;; clippy

;; (setq clippy-tip-show-function #'clippy-popup-tip-show)

#+end_src


**** undo-tree

#+begin_src emacs-lisp
;; undo-tree

;; (setq global-undo-tree-mode t)
(map! "<f5>" #'undo-tree-visualize)
(map! "<f3>" #'treemacs)
;; (global-set-key (kbd "SPC /") #'+default/search-buffer)
;; (global-set-key (kbd "M-.") #'+default/search-cwd)

 (defun init_undo-tree ()
     ;;  do awesome things
     (undo-tree-mode)
   )
 (add-hook 'buffer-list-update-hook 'init_undo-tree)

#+end_src


**** zlc

#+begin_src emacs-lisp

;; zlc is zsh something
(require 'zlc)
(zlc-mode t)

#+end_src


**** Beacon

#+begin_src emacs-lisp

;; beacon

(beacon-mode 1)
;; (after! lsp-mode (setq lsp-enable-file-watchers nil))


#+end_src




