doomemacs.org
** Packages

#+begin_src emacs-lisp :tangle ~/.config/doom/packages.el

;-**- no-byte-compile: t; -**-



(package! lsp-mode)
(package! lsp-ui)
(package! clippy)
(package! beacon)
(package! yasnippet)
(package! yasnippet-snippets)
(package! company-box)
(package! company-dict)
(package! company-mode)
(package! company-shell)
(package! fish-mode)
(package! powershell-mode)
(package! workroom)
;(package! chatgpt
;  :recipe (:host github :repo "joshcho/ChatGPT.el" :files ("dist" "**.el")))
(package! gptel)
(package! helm-swoop)
(package! sudo-edit :recipe (:host github :repo "nflath/sudo-edit"))
(package! auto-sudoedit :recipe (:host github :repo "ncaq/auto-sudoedit" ))
(package! undo-tree :recipe (:host github :repo "emacs-straight/undo-tree" ))
(package! helm-xref :recipe (:host github :repo "brotzeit/helm-xref" ))
(package! dired-sidebar)
(package! imenu-list)
(package! clippy)
(package! gamegrid)
(package! wc-mode)
(package! zlc)
(package! org-auto-tangle)
;; (package! sublimity)
(package! demap)
(package! realgud)
(package! spaceline)
(package! ox-pandoc)
(package! nix-mode)
(package! emacs-everywhere)
(package! auctex)
(package! auctex-latexmk)
(package! adaptive-wrap)
(package! cdlatex)
(package! evil-tex)
(package! latex-preview-pane)
(package! company-auctex)
(package! company-math)
(package! company-reftex)
(package! pdf-tools)

#+end_src
